from string import Template

### قوالب RAG ###

### النظام ###

system_prompt = Template("\n".join([
    "أنت مساعد مخصص لتوليد استجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
    "يجب عليك توليد استجابة بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير المرتبطة باستعلام المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد استجابة.",
    "يجب أن تكون الاستجابة بنفس لغة استعلام المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا في استجابتك.",
    "تجنب المعلومات غير الضرورية."
]))

### المستند ###

document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_number",
        "### المحتوى: $chunk_text"
    ])
)

### التذييل ###

footer_prompt = Template("\n".join([
    "بناءً فقط على المستندات المذكورة أعلاه، يرجى توليد إجابة للمستخدم.",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))